FROM golang:1.24.2-alpine AS builder 
# Используется официальный образ golang на Alpine Linux;

RUN apk add --no-cache git
# Устанавливает git внутри контейнера;
# Нужно для go mod download, если в go.mod есть зависимости из GitHub или других репозиториев;
# --no-cache уменьшает размер слоя, не оставляя кеш apk;

WORKDIR /app
# Устанавливает рабочую директорию внутри контейнера;
# Все команды COPY, RUN, go build будут выполняться относительно /app;

COPY go.mod go.sum ./
RUN go mod download

COPY . .

RUN go build -o server ./cmd/server/main.go

#===================================================================================

FROM alpine:3.20
# Новый, чистый контейнер Alpine, без Go и без лишних инструментов;
# В нём будет запускаться только бинарь Go;

RUN apk add --no-cache ca-certificates
# Устанавливаем корневые сертификаты,
# чтобы Go-бинарь мог работать с TLS/HTTPS, (GRPC MICROSERVICES)

WORKDIR /root/
# Рабочая директория для финального контейнера.
# Здесь будет лежать бинарь и запускаться сервер.

COPY --from=builder /app/server .
# Копируем готовый бинарь из предыдущего этапа сборки (builder) в текущий образ.
# --from=builder указывает, из какого этапа брать.
# . — текущая директория (/root/).

#===================================================================================

ENV PORT=44044

EXPOSE 44044

CMD ["./server"]